app/controllers/tops_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC LIMIT $1  [["LIMIT", 6]]
---
  def index
    @posts = Post.limit(6).order(created_at: :desc)