app/controllers/users_controller.rb

INSERT INTO `users` (`user_name`, `email`, `password_digest`, `salt`, `created_at`, `updated_at`) VALUES ('test', 'test@test', '$2a$12$78A6uyQo/MMsdJH4JXwNZO8cfek1eGa9VbQ.I5nm7fDYL.Ak7ySoS', NULL, '2024-08-24 07:05:35.743718', '2024-08-24 07:05:35.743718')
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT `posts`.* FROM `posts` INNER JOIN `favorites` ON `posts`.`id` = `favorites`.`post_id` WHERE `favorites`.`user_id` = 1 ORDER BY `posts`.`created_at` DESC LIMIT 6
---
  def show
    @user = current_user  # 現在のログインユーザー
    @posts = @user.posts.limit(6).order(created_at: :desc)  # 自身の投稿